In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.read_csv("combined_sale.csv")

In [17]:
df = df1.copy()

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 186850 entries, 0 to 186849
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        186305 non-null  object
 5   Purchase Address  186305 non-null  object
 6   Month             186850 non-null  object
dtypes: object(7)
memory usage: 10.0+ MB

In [6]:
df.head(8)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
0,150502,iPhone,1,700,02/18/19 01:35,"866 Spruce St, Portland, ME 04101",February
1,150503,AA Batteries (4-pack),1,3.84,02/13/19 07:24,"18 13th St, San Francisco, CA 94016",February
2,150504,27in 4K Gaming Monitor,1,389.99,02/18/19 09:46,"52 6th St, New York City, NY 10001",February
3,150505,Lightning Charging Cable,1,14.95,02/02/19 16:47,"129 Cherry St, Atlanta, GA 30301",February
4,150506,AA Batteries (4-pack),2,3.84,02/28/19 20:32,"548 Lincoln St, Seattle, WA 98101",February
5,150507,Lightning Charging Cable,1,14.95,02/24/19 18:50,"387 12th St, Austin, TX 73301",February
6,150508,AA Batteries (4-pack),1,3.84,02/21/19 19:26,"622 Center St, San Francisco, CA 94016",February
7,150509,Apple Airpods Headphones,1,150,02/26/19 19:53,"921 6th St, Seattle, WA 98101",February

In [26]:
# Using errors='coerce' to handle problematic entries gracefully
df['Order Date'] = pd.to_datetime(df['Order Date'], errors='coerce')

/var/folders/39/wyrxl9f95kd_tw3vzwk1slt80000gn/T/ipykernel_7708/306799121.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Order Date'] = pd.to_datetime(df['Order Date'], errors='coerce')

In [9]:
df.tail(8)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
186842,278789,Wired Headphones,1,11.99,2019-10-22 08:52:00,"617 Walnut St, Boston, MA 02215",October
186843,278790,USB-C Charging Cable,1,11.95,2019-10-26 10:58:00,"181 8th St, Boston, MA 02215",October
186844,278791,AAA Batteries (4-pack),1,2.99,2019-10-18 13:08:00,"537 Hill St, San Francisco, CA 94016",October
186845,278792,AA Batteries (4-pack),1,3.84,2019-10-12 04:32:00,"920 Adams St, San Francisco, CA 94016",October
186846,278793,Wired Headphones,1,11.99,2019-10-28 22:00:00,"161 Chestnut St, Los Angeles, CA 90001",October
186847,278794,AA Batteries (4-pack),1,3.84,2019-10-09 20:58:00,"346 Spruce St, San Francisco, CA 94016",October
186848,278795,iPhone,1,700,2019-10-31 17:21:00,"291 Hill St, Seattle, WA 98101",October
186849,278796,Wired Headphones,1,11.99,2019-10-13 11:20:00,"547 Jefferson St, Los Angeles, CA 90001",October

In [15]:
df.dropna(subset=['Order ID'], inplace=True)

In [16]:
df.isna().sum()

Order ID              0
Product               0
Quantity Ordered      0
Price Each            0
Order Date          355
Purchase Address      0
Month                 0
dtype: int64

In [22]:
df[df["Order Date"].isna() ==  True]

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
75,NaN,NaN,NaN,NaN,NaN,NaN,February
169,NaN,NaN,NaN,NaN,NaN,NaN,February
172,NaN,NaN,NaN,NaN,NaN,NaN,February
1488,NaN,NaN,NaN,NaN,NaN,NaN,February
1517,NaN,NaN,NaN,NaN,NaN,NaN,February
...,...,...,...,...,...,...,...
184390,NaN,NaN,NaN,NaN,NaN,NaN,October
184779,NaN,NaN,NaN,NaN,NaN,NaN,October
185239,NaN,NaN,NaN,NaN,NaN,NaN,October
185614,NaN,NaN,NaN,NaN,NaN,NaN,October
185993,NaN,NaN,NaN,NaN,NaN,NaN,October

In [23]:

df.dropna(subset=['Order Date'], inplace=True)

In [24]:
df.isna().sum()

Order ID            0
Product             0
Quantity Ordered    0
Price Each          0
Order Date          0
Purchase Address    0
Month               0
dtype: int64

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 186305 entries, 0 to 186849
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        185950 non-null  datetime64[ns]
 5   Purchase Address  186305 non-null  object
 6   Month             186305 non-null  object
dtypes: datetime64[ns](1), object(6)
memory usage: 11.4+ MB

In [35]:
import pyarrow

In [ ]:
# sometime there are repeated headers so check them and remove them
df[df['Price Each'] == 'Price Each']

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
1483,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,February
1904,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,February
2050,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,February
2225,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,February
3091,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,February
...,...,...,...,...,...,...,...
184502,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,October
184542,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,October
185088,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,October
185359,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,October
186774,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,October

In [39]:
df = df[df['Order ID'] != 'Order ID']

In [40]:
df['Price Each'] = df['Price Each'].astype('float64[pyarrow]')

In [42]:
df['Quantity Ordered'] = df['Quantity Ordered'].astype('Int64')

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 185950 entries, 0 to 186849
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  object
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  Int64
 3   Price Each        185950 non-null  double[pyarrow]
 4   Order Date        185950 non-null  datetime64[ns]
 5   Purchase Address  185950 non-null  object
 6   Month             185950 non-null  object
dtypes: Int64(1), datetime64[ns](1), double[pyarrow](1), object(4)
memory usage: 11.5+ MB

ValueError: No axis named 1480 for object type DataFrame